     HDFTACTGRP(*NO)
     FTESTFL158       20           DISK
     DAMT                       10     S
     OTESTFL158
     O                       AMT           1  10
      /free
  AMT = 123456;
  WRITE TESTFL158;
      /end-free
     C                   RETURN
