     H*A parameter-list name must be unique.
     HDFTACTGRP(*NO)
     DN                S             10I 0
     C     MYLIST        PLIST
     C                   PARM                    N
     C     MYLIST        PLIST
     C                   PARM                    N
     C                   RETURN
