     HDFTACTGRP(*NO)
     Dn                S             10I 0
     C     n             CASEQ     1             sub1
     C                   RETURN
     C     sub1          BEGSR
     C                   ENDSR
