     HDFTACTGRP(*NO)
     Dn                S             10I 0
     C                   EVAL      n = 7
     C                   IF        n = 5
     C     'five'        DSPLY
     C                   ELSEIF    n = 7
     C     'seven'       DSPLY
     C                   ELSE
     C     'other'       DSPLY
     C                   ENDIF
     C                   RETURN
