     HDFTACTGRP(*NO)
     Dgreeting                  20     A
     D*comment line: col7='*' means whole line is a comment, even mid D-spec block
     Dcount                     10     I0
