     HDFTACTGRP(*NO)
     Dn                S             10I 0
     Dpgmvar           S             10A
     C                   CALL      pgmvar
     C                   RETURN
