     HDFTACTGRP(*NO)
     Dgreeting         S             20A
     D*comment line: col7='*' means whole line is a comment, even mid D-spec block
     Dcount            S             10I 0
