     HDFTACTGRP(*NO)
     FTESTFL160       10           DISK
     ITESTFL160
     I                             A    1   10  F1              M1
     C                   RETURN
