     HDFTACTGRP(*NO)
     Dn                         10     I0
     C                   EVAL      n = 1
     C   10              IF        n = 1
     C                   ENDIF
     C                   RETURN
