     HDFTACTGRP(*NO)
     Dn                         10     I0
     Dr                         10     A   VARYING
     C                   EVAL      n = 5
     C     n             COMP      3                                  102030
     C   10              EVAL      r = 'hi'
     C   20              EVAL      r = 'lo'
     C   30              EVAL      r = 'eq'
     C     r             DSPLY
     C     n             COMP      5                                  102030
     C   10              EVAL      r = 'hi'
     C   20              EVAL      r = 'lo'
     C   30              EVAL      r = 'eq'
     C     r             DSPLY
     C     n             COMP      9                                  102030
     C   10              EVAL      r = 'hi'
     C   20              EVAL      r = 'lo'
     C   30              EVAL      r = 'eq'
     C     r             DSPLY
     C                   RETURN
