     HDFTACTGRP(*NO)
     Dn                S             10I 0
     C                   EVAL      n = 999
     C                   Z-ADD     42            n
     C     %CHAR(n)      DSPLY
     C                   Z-SUB     42            n
     C     %CHAR(n)      DSPLY
     C                   RETURN
