     HDFTACTGRP(*NO)
     Di                         10     I0
     C                   FOR       i = 1 TO 3
     C     %CHAR(i)      DSPLY
     C                   ENDFOR
     C                   FOR       i = 10 DOWNTO 6 BY 2
     C     %CHAR(i)      DSPLY
     C                   ENDFOR
     C                   RETURN
