     HDFTACTGRP(*NO)
     Di                         10     I0
     C                   EVAL      i = 0
     C                   DOW       i < 3
     C     %CHAR(i)      DSPLY
     C                   EVAL      i = i + 1
     C                   ENDDO
     C                   EVAL      i = 0
     C                   DOU       i >= 3
     C                   EVAL      i = i + 1
     C     %CHAR(i)      DSPLY
     C                   ENDDO
     C                   RETURN
