     HDFTACTGRP(*NO)
     Dnm               S             50A   VARYING
     C/EXEC SQL
     C+ SELECT nm INTO :nm FROM fx190 WHERE id = 1
     C                   RETURN
