     HDFTACTGRP(*NO)
     Da                         10     A
     Db                         10     A
     C                   MOVE      a             b
     C                   RETURN
