     H*SPECIFICATIONS COME IN THE ORDER H, F, D, I, C, O. IBM I REJECTS
     H*CALCULATIONS AFTER OUTPUT SPECIFICATIONS (RNF0257).
     FTESTFL158 O    F   20        DISK
     DAMT              S             10S 0
     C                   EVAL      AMT = 1
     C                   EXCEPT
     OTESTFL158 E
     O                       AMT                 10
     C                   RETURN
