     HDFTACTGRP(*NO)
     Dn                         10     I0
     C     n             CASEQ     1             sub1
     C                   RETURN
     C     sub1          BEGSR
     C                   ENDSR
