     HDFTACTGRP(*NO)
     Dn                S             10I 0
     C     n             CASXY     1             sub1
     C                   ENDCS
     C                   RETURN
     C     sub1          BEGSR
     C                   ENDSR
