     HDFTACTGRP(*NO)
     Dn                         10     I0
     Dpgmvar                    10     A
     C                   CALL      pgmvar
     C                   RETURN
