     HDFTACTGRP(*NO)
     Dn                         10     I0
     Darr                       10     I0  DIM(3)
     C                   EVAL      n = 99
     C                   CLEAR                   n
     C     %CHAR(n)      DSPLY
     C                   RESET                   n
     C     %CHAR(n)      DSPLY
     C                   EVAL      arr(1) = 3
     C                   EVAL      arr(2) = 1
     C                   EVAL      arr(3) = 2
     C                   SORTA     arr
     C     %CHAR(arr(1)) DSPLY
     C     %CHAR(arr(2)) DSPLY
     C     %CHAR(arr(3)) DSPLY
     C                   RETURN
