     HDFTACTGRP(*NO)
     Dn                S             10I 0
     C                   EVAL      n = 2
     C                   SELECT
     C                   WHEN      n = 1
     C     'one'         DSPLY
     C                   WHEN      n = 2
     C     'two'         DSPLY
     C                   OTHER
     C     'other'       DSPLY
     C                   ENDSL
     C                   RETURN
