     HDFTACTGRP(*NO)
     Ddoc                       100    A   VARYING
     C                   XML-SAX   %HANDLER(h : doc)
     C                   RETURN
