     HDFTACTGRP(*NO)
     Dtotal                     10     I0
     C                   EVAL      total = 1 + 2 + 3 + 4 + 5 + 6 + 7 +
     C                             8 + 9 + 10 + 11 + 12 + 13 + 14 + 15
     C     %CHAR(total)  DSPLY
     C                   IF        total > 100 AND total <
     C                             1000
     C     'in range'    DSPLY
     C                   ENDIF
     C                   RETURN
