     HDFTACTGRP(*NO)
     Ddoc              S            100A   VARYING
     C                   XML-SAX   %HANDLER(h : doc)
     C                   RETURN
