     HDFTACTGRP(*NO)
     FTESTFL160 IF   F   10        DISK
     ITESTFL160 AA
     I                             A    1   10  F1              M1
     C                   RETURN
