     HDFTACTGRP(*NO)
     Da                         10     A
     Dn                         10     I0
     C                   MOVE      a             n
     C                   RETURN
